# Семинар #9
# Домашняя работа
# Задача 2.
# Создайте двумерный массив, размером 5х5. Определите, есть ли в нём одинаковые строки.

def main():
    print("hi")


main()
