# Семинар 10
# Домашняя работа
# Задание 1
# Найдите, какая область центрального федерального округа имела наибольшую численность студентов вечерней формы обучения в 2015 году.

def main():
    print("")


main()

