# Семинар 9
# Домашняя работа
# Задача 3.
# Создайте двумерный массив случайного размера. Найдите индексы максимального и минимального элементов в нём.
# Выведите элементы главной диагонали матрицы в виде одномерного массива.


def main():
    print("hi")


main()
