# Семинар 4
# Задание 4
# Актёров разделили на списки по трём качествам «умные», «красивые», «сильные».
# На главную роль нужен актёр обладающий всеми тремя качествами. Определите, сколько есть претендентов на главную роль.

def main():
    handsomeSet = {"Илья", "Федор", "Семен", "Олег", "Лев", "Антон", "Артем", "Боря", "Стас", "Марк", "Ян"}
    smartSet = {"Илья", "Георгий", "Лев", "Демьян", "Антон", "Владислав", "Боря", "Стас", "Марк", "Влад"}
    strongSet = {"Федор", "Георгий", "Олег", "Демьян", "Артем", "Елисей", "Боря", "Стас", "Влад"}

    candidatesSet = (handsomeSet.intersection(smartSet)).intersection(strongSet)
    print(candidatesSet)
    print(f"there are {len(candidatesSet)} candidates suitable")


main()

